# Pandas

In [1]:
# Pandas is built on top of the NumPy library

# Pandas stores the data in 2 structures:
# 1. Series
# 2. DataFrame

## Series
Series is one-dimensional labelled array capable of holding data like str,int,object

Series is nothing but a column in an excel sheet

In [2]:
import pandas as pd
import numpy as np

data=np.array(['a','n','a','n','d'])
result=pd.Series(data)
print(result)

0    a
1    n
2    a
3    n
4    d
dtype: object

## DataFrame

In [3]:
# DataFrame is two-dimensional array with labelled axes (rows, columns)

# In this data is alligned in tabular format

# DataFrame main components are: 1. rows, 2. columns, 3.data

## Creating DataFrame

In [4]:
import pandas as pd

data=['code','new','project','for','life']
df=pd.DataFrame(data, columns=['Words'])
print(df) # or we can also use 'df.head()'

     Words
0     code
1      new
2  project
3      for
4     life

## Creating DataFrame from CSV file

In [5]:
import pandas as pd

df=pd.read_csv("C:\\Users\\lette\\Data Visualization\\iris.csv")
df.head() 
# we can pass arguments like 10 or 20 for seeing that length of rows of data

   150    4  setosa  versicolor  virginica
0  5.1  3.5     1.4         0.2          0
1  4.9  3.0     1.4         0.2          0
2  4.7  3.2     1.3         0.2          0
3  4.6  3.1     1.5         0.2          0
4  5.0  3.6     1.4         0.2          0

## Filtering DataFrame

In [6]:
# filter() function filters rows or columns based on specifications

In [7]:
df.filter(['setosa','versicolor','virginica']).head()

# filter() doesn't change or modify the actual data content, its just for comfort of reading

   setosa  versicolor  virginica
0     1.4         0.2          0
1     1.4         0.2          0
2     1.3         0.2          0
3     1.5         0.2          0
4     1.4         0.2          0

## Sorting DataFrame

In [8]:
# sort_values() function sorts the data in Assending or Dissending Order

In [9]:
df.sort_values(by='setosa',ascending=True).head()

# if we use "ascending=False" we get "Descending Order"

    150    4  setosa  versicolor  virginica
22  4.6  3.6     1.0         0.2          0
13  4.3  3.0     1.1         0.1          0
14  5.8  4.0     1.2         0.2          0
35  5.0  3.2     1.2         0.2          0
16  5.4  3.9     1.3         0.4          0

## Pandas Groupby

In [10]:
# In real world project we'll be dealing with large datasets, 
# for efficiency we use Groupby

# Groupby is a process involving one or more steps from the following steps:
# 1. Splitting: We split data into groups by applying some condition or datasets
# 2. Applying: we apply a function to each group independently
# 3. Combining: we combine different datasets into one data structure, after applying groupby

In [25]:
import pandas as pd

data1 = {'Name': ['Jai', 'Anuj', 'Jai', 'Princi',
                  'Gaurav', 'Anuj', 'Princi', 'Abhi'],
         'Age': [27, 24, 22, 32,
                 33, 36, 27, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                     'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd',
                           'B.Tech', 'B.com', 'Msc', 'MA']}

af=pd.DataFrame(data1)
print("original dataset:")
print(af)

gk=af.groupby("Name")
print("after groupby:")
gk.first()  # it gives only the unique values

original dataset:
     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
after groupby:

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

## DataFrame Concatenation

Example: You have sales data for different months in separate tables and need to combine them into one big table

In [ ]:
# concat() function stacks DataFrame vertically or Horizontally (Rows or Columns)

# We pile up the datasets when we have similar columns
# Or we stack side-by-side without any matching keys

In [34]:
import pandas as pd

data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32]}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df1.head()  # dataset 1

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

In [35]:
df2.head()   # dataset 2

  key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [41]:
# concatenating [dataset 1 + dataset 2 = dataset 3]

df3=pd.concat([df1,df2], axis=1) 
df3.head()

  key    Name  Age key    Address Qualification
0  K0     Jai   27  K0     Nagpur         Btech
1  K1  Princi   24  K1     Kanpur           B.A
2  K2  Gaurav   22  K2  Allahabad          Bcom
3  K3    Anuj   32  K3    Kannuaj        B.hons

In [46]:
# for vertical concatenation axis=0

vertical_df3=pd.concat([df1,df2],axis=0)
vertical_df3.head(8)

  key    Name   Age    Address Qualification
0  K0     Jai  27.0        NaN           NaN
1  K1  Princi  24.0        NaN           NaN
2  K2  Gaurav  22.0        NaN           NaN
3  K3    Anuj  32.0        NaN           NaN
0  K0     NaN   NaN     Nagpur         Btech
1  K1     NaN   NaN     Kanpur           B.A
2  K2     NaN   NaN  Allahabad          Bcom
3  K3     NaN   NaN    Kannuaj        B.hons

## Joining DataFrame

Example: Add new demographic columns to your customer records, based on customers' existing row labels.

In [ ]:
# join() function combines dataframe based on indexes (row labels)

In [50]:
import pandas as pd

set1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 

set2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

mf1=pd.DataFrame(set1, index=['k0','k1','k2','k3'])
print("Set 1: ")
mf1.head()

Set 1:

      Name  Age
k0     Jai   27
k1  Princi   24
k2  Gaurav   22
k3    Anuj   32

In [52]:
mf2=pd.DataFrame(set2, index=['k0','k1','k2','k3'])
print("Set 2: ")
mf2.head()

Set 2:

      Address Qualification
k0  Allahabad           MCA
k1    Kannuaj           Phd
k2  Allahabad          Bcom
k3    Kannuaj        B.hons

In [55]:
joined_data=mf1.join(mf2) # we combined mf2 with mf1
print("Joined Data: ")
joined_data.head()

Joined Data:

      Name  Age    Address Qualification
k0     Jai   27  Allahabad           MCA
k1  Princi   24    Kannuaj           Phd
k2  Gaurav   22  Allahabad          Bcom
k3    Anuj   32    Kannuaj        B.hons

## Merging DataFrame

Example: Imagine you have two tables—one with employee names and IDs, and another with their ages linked 
by the same IDs.

In [56]:
# merge() combines dataframes based on common columns and indexes

# this is perfect choice when we have tables with shared "keys"

# it mimics SQL's:
# 1. inner join
# 2. left outer join
# 3. right outer join
# 4. FULL outer join

In [58]:
import pandas as pd

table1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 

table2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

jk1=pd.DataFrame(table1)
print("Table 1: ")
jk1.head()

Table 1:

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

In [60]:
jk2=pd.DataFrame(table2)
print("Table 2: ")
jk2.head()

Table 2:

  key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [61]:
merged_tables=pd.merge(jk1,jk2, on='key')
print("Merged Table: ")
merged_tables.head()

Merged Table:

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons